{
  "vision": {
    "ar": "تحقيق الريادة في تنمية المشاريع المتخصصة في البنية التحتية والاستثمار من خلال التميز في الأسلوب المتطور في هذا المجال.",
    "en": "Achieve leadership in the development and execution of projects in infrastructure and investment through excellence and advanced methods in this field."
  },
  "mission": {
    "ar": "تعزيز موضع الشركة في خضم التنمية الاقتصادية والاجتماعية في المملكة العربية السعودية في ظل رؤية السعودية 2030 بالتركيز على تطبيق أساليب متطورة في إدارة وتنفيذ مشاريع البنية التحتية.",
    "en": "Enhancing the company's position in the midst of economic and social development in the Kingdom of Saudi Arabia in light of the Saudi Vision 2030 by focusing on the application of advanced methods in managing and implementing infrastructure projects."
  },
  "company_history": {
    "ar": "شركة باتع فالح الشعبي للمقاولات تأسست واختصت في مشاريع البنية التحتية نتيجة لزيادة الطلب على المشاريع المتخصصة في البنية التحتية والإنشاءات في المدينة المنورة خاصة وجميع مناطق المملكة العربية السعودية. تم تحويل مؤسسة باتع فالح الشعبي للمقاولات إلى شركة باتع فالح الشعبي للمقاولات للتوسع بالمشاريع ولحوكمة الشركة بشكل أفضل.",
    "en": "Batie Faleh Al Shaabi Contracting Company was established as a specialized company in infrastructure projects as a result of the increased demand for infrastructure and construction projects in terms of comprehensive expansion in Medina especially and all regions of the Kingdom of Saudi Arabia. Bati Falih Al-Shaabi establishment was transformed into Bati Falih Al-Shaabi Company to expand projects and to better govern the company."
  },
  "specialty": {
    "ar": "لدينا خبرة متميزة في كافة الأعمال في مشاريع البنية التحتية والأعمال الترابية. كما أن الشركة مصنفة درجة أولى في التشييد والبناء من قبل وزارة الشؤون البلدية والقروية والإسكان.",
    "en": "We have distinguished experience in all infrastructure and earth works. The company is classified as first class in construction by the Ministry of Municipal and Rural Affairs and Housing."
  }
}
